Repository: BaherTamer/ViewKit
Catalog: Sources/ViewKit/Localizable.xcstrings
Source language: en
Languages: ar

source: Full Name Must Consist of at Least a First Name and a Last Name
ar: يجب أن يتكون الاسم الكامل من اسم أول واسم عائلة على الأقل

source: Full Name Must Contain Only Letters and Spaces
ar: يجب أن يحتوي الاسم الكامل على حروف ومسافات فقط

source: National Number Must Be Exactly 14 Digits Long
ar: يجب أن يتكون الرقم القومي من 14 رقمًا

source: National Number Must Contain Only Digits
ar: يجب أن يحتوي الرقم القومي على أرقام فقط

source: Password Must Be at Least 8 Characters Long
ar: يجب ألا يقل طول كلمة المرور عن 8 أحرف

source: Password Must Contain at Least One Lowercase Letter
ar: يجب أن تحتوي كلمة المرور على حرف واحد على الأقل من الأحرف الصغيرة

source: Password Must Contain at Least One Number
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل

source: Password Must Contain at Least One Special Character
ar: يجب أن تحتوي كلمة المرور على رمز واحد على الأقل

source: Password Must Contain at Least One Uppercase Letter
ar: يجب أن تحتوي كلمة المرور على حرف واحد على الأقل من الأحرف الكبيرة

source: Password Must Not Contain Spaces
ar: يجب ألا تحتوي كلمة المرور على مسافات

source: Phone Number Must Be 11 Digits
ar: يجب أن يتكون رقم الهاتف من ١١ رقمًا

source: Phone Number Must Begin With 01
ar: يجب أن يبدأ رقم الهاتف ب ٠١

source: The Email Address Is Invalid
ar: عنوان البريد الإلكتروني غير صالح

source: The National Number Is Invalid
ar: الرقم القومي غير صالح

source: The Phone Number Is Invalid
ar: رقم الهاتف غير صالح

source: This Field Is Required
ar: هذا الحقل مطلوب

source: Today
ar: اليوم
